tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "shopify/shopify"
tap "homebrew/cask-fonts"

brew "bash-completion"
brew "docker", link: false
brew "fdupes"
brew "fish"
brew "git"
brew "google-sql-tool"
brew "k9s"
brew "kubernetes-cli", link: false
brew "mas"
brew "python@3.9"
brew "mycli"
brew "node"
brew "nvm"
brew "pv"
brew "rbenv"
brew "wget"
brew "shopify/shopify/ejson"
cask "1password"
cask "alfred"
cask "bartender"
cask "cleanmymac"
cask "docker"
cask "evernote"
cask "firefox-nightly"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive-file-stream"
cask "iterm2"
cask "mysqlworkbench"
cask "rambox"
cask "sequel-pro"
cask "signal"
cask "skype"
cask "slack"
cask "sourcetree"
cask "spotify"
cask "tower"
cask "visual-studio-code"
cask "font-hack-nerd-font"

mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
