tap "atlassian/acli"
tap "buo/cask-upgrade"

# CLI Tools
brew "bash-completion"
brew "bat"
brew "fdupes"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "k9s"
brew "kubernetes-cli"
brew "lynx"
brew "mas"
brew "mycli"
brew "node"
brew "nvm"
brew "prettyping"
brew "pv"
brew "pygitup"
brew "rbenv"
brew "ripgrep"
brew "speedtest-cli"
brew "starship"
brew "terraform"
brew "tree-sitter"
brew "wget"
brew "yadm"
brew "yt-dlp"
brew "z"

# Development Tools
cask "cursor"
cask "docker"
cask "docker-desktop"
cask "gitkraken"
cask "postman"
cask "sourcetree"
cask "sublime-text"
cask "visual-studio-code"
cask "warp"

# Browsers
cask "brave-browser"
cask "firefox"
cask "firefox@nightly"
cask "google-chrome"
cask "vivaldi"

# Productivity
cask "1password"
cask "1password-cli"
cask "bartender"
cask "cleanmymac"
cask "deepl"
cask "evernote"
cask "focus"
cask "gather"
cask "languagetool-desktop"
cask "linear-linear"
cask "loom"
cask "lunar"
cask "miro"
cask "notion"
cask "rar"
cask "raycast"
cask "readdle-spark"
cask "shottr"
cask "todoist-app"
cask "xbar"
cask "xnapper"

# Communication
cask "discord"
cask "signal"
cask "slack"
cask "whatsapp"
cask "zoom"

# AI Tools
cask "boltai"
cask "chatgpt"
cask "draw-things"
cask "limitless"
cask "lm-studio"

# Cloud & Storage
cask "cryptomator"
cask "gcloud-cli"
cask "google-drive"

# Media & Entertainment
cask "audacity"
cask "spotify"
cask "steam"
cask "vlc"

# Utilities
cask "balenaetcher"
cask "dadroit-json-viewer"
cask "insomnia"
cask "itsycal"
cask "little-snitch"
cask "logitune"
cask "mullvad-vpn"
cask "raspberry-pi-imager"
cask "teamviewer"
cask "zettlr"

# Fonts
cask "font-hack-nerd-font"

# Mac App Store
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
